# LDevice_DlgResource

## Description
Sets the Ligtning Device Resource selector in the pointed field

```pascal
PROCEDURE LDevice_DlgResource(
				LayoutID   : INTEGER;
				ControlID  : INTEGER;
				SymbolName : STRING);
```

```python

def vs.LDevice_DlgResource(LayoutID, ControlID, SymbolName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|LayoutID|INTEGER||
|ControlID|INTEGER||
|SymbolName|STRING||

## Version
Availability: from Vectorworks 2019
## Category
* Spotlight